Инвентаризация_IT/src/Catalogs/Принтеры/Принтеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Принтеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодключения</name>
    <type>
      <types>EnumRef.ТипыПодключенияПринтеров</types>
    </type>
  </attributes>
  <attributes>
    <name>IPАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МодельКартриджа</name>
    <type>
      <types>CatalogRef.Картриджи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

Инвентаризация_IT/src/Catalogs/ВидыОборудования/ВидыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОборудования</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Видеорегистратор</name>
      <description>Видеорегистратор</description>
    </items>
    <items>
      <name>Камера</name>
      <description>Камера</description>
    </items>
    <items>
      <name>Картридж</name>
      <description>Картридж</description>
    </items>
    <items>
      <name>Монитор</name>
      <description>Монитор</description>
    </items>
    <items>
      <name>СистемныйБлок</name>
      <description>Системный блок</description>
    </items>
    <items>
      <name>Принтер</name>
      <description>Принтер</description>
    </items>
    <items>
      <name>ПринтерЭтикеток</name>
      <description>Принтер этикеток</description>
    </items>
    <items>
      <name>ТерминалСбораДанных</name>
      <description>Терминал сбора данных</description>
    </items>
    <items>
      <name>СистемныйБлокТонкийКлиент</name>
      <description>Системный блок (тонкий клиент)</description>
    </items>
  </predefined>
</mdclass:Catalog>

Инвентаризация_IT/src/Catalogs/Принтеры/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если ВидОборудования = Справочники.ВидыОборудования.Принтер Тогда
		Префикс = "ИТ-ПР";
		Иначе
		 Если ВидОборудования = Справочники.ВидыОборудования.ПринтерЭтикеток Тогда
		 	 Префикс = "ИТ-ПЭ";
		 КонецЕсли;
	КонецЕсли;	 
КонецПроцедуры
